package ru.mephi.week3.lesson2;

public class Task1 {

    /**
     * <H2>Задача: Обратный порядок слов</H2>
     * <br>
     * <H2>Описание:</H2>
     * <p>Дана строка {@code s} измените порядок слов в обратном порядке.
     * Слово определяется как последовательность символов без пробелов.
     * Составьте строку слов в обратном порядке, соединенных одним пробелом.</p>
     * <br>
     * <p>Обратите внимание, что s может содержать начальные или конечные пробелы
     * или несколько пробелов между двумя словами. Возвращаемая строка должна содержать
     * только один пробел, разделяющий слова. Не включайте никаких дополнительных пробелов.</p>
     * <br>
     * <H2>Пример:</H2>
     * Input: s = "the sky is blue"
     * Output: "blue is sky the"
     */

    public static void main(String[] args) {

        String s = "the sky is blue";

        // TODO: write code

    }

}