package ru.mephi.week5.lesson1.task2.task;

public class Main {

    /**
     * <h2>Задача: Управление событиями</h2>
     * <br>
     * <h2>Описание: </h2>
     * <p>Создайте класс <code>Event</code>, который будет представлять собой событие с следующими полями:</p>
     * <ul>
         * <li>{@code String title} — название события.</li>
         * <li>{@code Date date} — дата и время события.</li>
         * <li>{@code String location} — место проведения события.</li>
     * </ul>
     * <p>Реализуйте следующие функциональности:</p>
         * <li>Добавление события: Создайте метод, который позволяет добавлять событие с указанным названием, датой и местом.</li>
         * <li>Вывод списка событий: Создайте метод, который выводит все события в формате "Название: [title], Дата: [formatted date], Место: [location]".</li>
         * <li>Поиск событий по дате: Реализуйте метод, который принимает дату и выводит все события, которые происходят в этот день.</li>
         * <li>Изменение даты события: Реализуйте метод для изменения даты уже существующего события.</li>
     * </li>
     */


    public static void main(String[] args) {

    }

}
