package ru.mephi.week6.lesson1;

import java.io.IOException;

public class Task2 {

    /**
     * <h2>Задание: разработка программы для резервного копирования файлов с фильтрацией по типу</h2>
     * <br>
     * <h2>Описание: </h2>
     * <p>Вам необходимо написать программу, которая выполняет резервное копирование всех
     * файлов из одной директории в другую. Программа должна:</p>
     * <ul>
     * 	<li>Копировать только файлы определённого расширения (например, .jpg, .png, .txt), которые указаны пользователем.</li>
     *  <li>Если файл с таким именем уже существует в целевой директории, программа должна спрашивать у пользователя, перезаписывать его или пропустить.</li>
     * 	<li>Все действия программы (начало копирования, успешное завершение, ошибки) должны логироваться в файл backup_log.txt.</li>
     * 	<li>Программа должна выводить общее количество скопированных файлов, а также количество пропущенных файлов.</li>
     * 	</ul>
     */

    public static void main(String[] args) throws IOException {

    }

}
