package ru.mephi.week6.lesson1;

public class Task1 {

    /**
     * <h2>Задача: копирование изображения</h2>
     * <br>
     * <h2>Описание: </h2>
     * <p>Вам необходимо написать программу, которая копирует файл изображения с
     * одного места в другое, используя классы FileInputStream и FileOutputStream. Программа должна:</p>
     * <ul>
     * <li>Прочитать исходный файл изображения (например, image.jpg) с помощью класса FileInputStream.</li>
     * <li>Записать прочитанные данные в новый файл (например, copy_image.jpg) с помощью класса FileOutputStream.</li>
     * <li>Для повышения производительности используйте чтение данных порциями (например, по 4 KB), чтобы не читать по одному байту за раз.</li>
     * </ul>
     */

    public static void main(String[] args) {

    }

}
