package ru.mephi.week7.lesson1;

public class Task1 {

    /**
     * <h2>Задача: калькулятор с обработкой ошибок</h2>
     * <br>
     * <h2>Описание:</h2>
     * <p>Напишите программу, которая запрашивает у пользователя два числа и одну
     * математическую операцию (например: +, -, *, /). Программа должна выполнить
     * соответствующую операцию над числами и вывести результат. При этом программа
     * должна корректно обрабатывать следующие ошибки:</p>
     * <ul>
     * 	<li>Деление на ноль (ArithmeticException).</li>
     * 	<li>Неправильный формат чисел (если пользователь ввёл не число) (NumberFormatException).</li>
     * 	<li>Неподдерживаемую операцию (если пользователь ввёл что-то отличное от +, -, *, /).</li>
     * 	</ul>
     */


    public static void main(String[] args) {

    }

}
