package ru.mephi.week5.lesson2;

public class Task1 {

    /**
     * <h2>Задание: текстовый оптимизатор</h2>
     * <br>
     * <h2>Описание:</h2>
     * <p>Напишите программу на Java, которая:</p>
     * <ul>
     * 	<li>Запрашивает у пользователя путь к каталогу, содержащему текстовые файлы.</li>
     * 	<li>Проверяет, существует ли указанный каталог.</li>
     * 	<li>Перебирает все файлы в каталоге и находит те, которые были созданы более 7 дней назад.</li>
     * 	<li>Объединяет содержимое этих файлов в один файл, названный merged_old_files.txt.</li>
     * 	<li>После успешного объединения удаляет файлы, которые были включены в объединение.</li>
     * 	<li>Если каталог не существует или в нём нет файлов старше 7 дней, программа выводит соответствующие сообщения.</li>
     * 	</ul>
     */

    public static void main(String[] args) {

    }

}
