package ru.mephi.week8.lesson2.task1;

public class Task1 {

    /**
     * <h2>Задание: частотный анализ</h2>
     * <br>
     * <h2>Описание</h2>
     * <p>Напишите программу на Java, которая принимает текстовый ввод и подсчитывает,
     * сколько раз каждое слово встречается в тексте. Программа должна игнорировать
     * регистр букв (например, слова “Java” и “java” считаются одинаковыми). В конце
     * программа должна вывести каждое слово и количество его появлений</p>
     */


    public static void main(String[] args) {

    }

}
