package ru.mephi.week5.lesson1.task3;

public class Task {


    /**
     * <h2>Задача: угадай число</h2>
     * <br>
     * <h2>Описание</h2>
     * Реализовать простую игру "Угадай число", где программа будет генерировать случайное число, а пользователь должен угадать его.
     * <ul>
     * <li>Программа генерирует случайное число в диапазоне от 1 до 100.</li>
     * <li>Пользователь вводит свои догадки.</li>
     * <li>Программа предоставляет подсказки: "слишком высоко", "слишком низко" или "угадали".</li>
     * <li>Программа будет отслеживать количество попыток и выводить его в конце.</li>
     * </ul>
     */

    public static void main(String[] args) {

    }

}
