package ru.mephi.week6.lesson2;

public class Task1 {

    /**
     * <h2>Задание: Чтение данных из консоли и запись в файл</h2>
     * <br>
     * <h2>Описание:</h2>
     * <p>Напишите программу, которая позволяет пользователю вводить строки
     * текста, и завершает ввод по команде "exit". Все введённые строки должны
     * быть записаны в файл. Используйте {@code Scanner} для чтения с консоли и
     * {@code FileWriter} для записи в файл.</p>
     */

    public static void main(String[] args) {

    }

}
