package ru.mephi.week6.lesson2;

public class Task3 {

    /**
     * <h2>Задание: Программа для анализа текстового файла</h2>
     * <br>
     * <h2>Описание:</h2>
     * <p>Программа выполняет следующие действия:</p>
     * <ul>
     * <li>Читает текстовый файл, содержащий произвольный текст.</li>
     * <li>Подсчитывает количество строк, слов и символов в файле.</li>
     * <li>Определяет, сколько раз каждое слово встречается в тексте (игнорируя регистр).</li>
     * <li>Записывает результаты анализа в новый файл.</li>
     * </ul>
     */

    public static void main(String[] args) {

    }


}
